<template>
  <div class="container-fluid">
    <h1 class="lg">Judo | 柔道</h1>
    <div id="judo_image">
      <img src="../../assets/Judo_Kano_Jigoro.jpg" alt="" />
    </div>
    <div id="judo_description">
      <h2>柔道的创始人 | 嘉納治五郎</h2>
      <p>柔道的早期历史离不开他的创始人，日本博物学家，教育家——嘉納治五郎</p>
      <p>
        嘉纳出生于相对富裕的人家，他的父亲，作次郎，是滋贺县日吉神社的一名高级神官的次子。他迎娶了菊正宗酒造株式会社老板的千金，嘉納貞子
        ，同时也是被他们抚养长大，也因此改姓为嘉纳，他最终成为了幕府政府的一名官员。
      </p>
      <p>
        嘉納治五郎拥有很高的学术教养，他从七岁开始在四个老师的教育下学习英语，书法，《四书》。十四岁的时候前往东京芝的一所育英義塾英语学校寄宿读书。
        地区歧视和校园欺凌促使嘉納去寻找柔术道场进行锻炼
      </p>
      <p>
        早期的求学之路并不成功，在1868年明治维新中的德川幕府的倒台，在日渐西化的日本，柔术越来越被排挤。
        许多曾经教导柔术的老师被迫放弃教学或者因幻想破灭而放弃。中井卯目（翻译），曾参过军是嘉納父亲的朋友，愿意向他展示一些技法，但只是展示。
        作治郎的第二间房子的看护人，片霧隆二，也会柔术，但也是不想教授给他，因为他相信这些柔术已经不实用了。还有一个常客，是学习柔术扱心流的今井源四郎
        也拒绝了他的请求。直到几年后他才终于找到一个愿意传授的老师。
      </p>
      <p>
        在1877年，还在东京开成学校（之后成为了东京帝国大学的一部分）就读的他，了解到许多柔术老师被迫去找谋生工作，他们大部分都会去开整骨院，咨询了一些老师之后，
        嘉納被介绍遇见福田八之介，他是天神真楊流柔术的一名老师，有一块面积为的九块榻榻米大小的道场，在教授五位学员。福田更加注重技法而不是标准训练，这在嘉納的心中为注重
        乱取り（自由训练）播下了种子。
      </p>
      <p>
        1880年福田去世，而嘉納成为了他旗下最优秀的学生，不论是在乱取り还是形，他都是最拔尖的。被授予了福田道场卷宗。
      </p>
    </div>
  </div>
</template>

<style scoped>
.container-fluid {
  min-height: 100vh;
}

#judo_image {
  margin-right: 30px;
  padding-right: 30px;
  border-right: 3px solid black;
  float: left;
}

#judo_image img {
  height: 250px;
}
</style>